src/ex_Tabakon/InformationRegisters/ТБК_Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТБК_Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ex_Tabakon/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ex_Tabakon/CommonModules/РаботаСоШтрихкодами/Ext/Module.bsl
&ИзменениеИКонтроль("ДанныеПоискаПоШтрихкоду")
Функция ТБКДанныеПоискаПоШтрихкоду(Штрихкод, Форма)

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыСобытийПО") Тогда
		Если Форма.ПараметрыСобытийПО = Неопределено Тогда
			СтруктураДействий = Новый Структура;
		Иначе
			СтруктураДействий = Форма.ПараметрыСобытийПО;
		КонецЕсли;
	Иначе
		СтруктураДействий = Новый Структура;
	КонецЕсли;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ФильтрПоискаПоШтрихкоду") Тогда
		Если Форма.ФильтрПоискаПоШтрихкоду = Неопределено Тогда
			ФильтрПоискаПоШтрихкоду = Новый Структура;
			РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьФильтрПоискаПоУмолчанию(ФильтрПоискаПоШтрихкоду);
		Иначе
			ФильтрПоискаПоШтрихкоду = Форма.ФильтрПоискаПоШтрихкоду;
		КонецЕсли;
	Иначе
		ФильтрПоискаПоШтрихкоду = Новый Структура;
		РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьФильтрПоискаПоУмолчанию(ФильтрПоискаПоШтрихкоду);
	КонецЕсли;

	СуффиксСерверЛояльности = "";
	Если ФильтрПоискаПоШтрихкоду.Свойство("ДанныеПокупателя") Тогда
		СуффиксСерверЛояльности = "СЛ";
		ФильтрПоискаПоШтрихкоду.Удалить("ДанныеПокупателя");
	КонецЕсли;

	Запрос = Новый Запрос();

	КодМаркировкиОригинал = "";
	ЭтоКодМаркировки = Ложь;
	ДанныеМаркировки = Неопределено;
	ДанныеРазбораКода = Неопределено;
	ШтрихкодПоиска = Штрихкод;
	ШтрихкодМарки = Штрихкод;
	НомерТелефона = "";
	АдресЭП = "";
	КИПоШтрихкоду = ТипКонтактнойИнформацияПоШтрихкоду(Штрихкод);
	Если КИПоШтрихкоду.Свойство("НомерТелефона", НомерТелефона) Тогда
		ФильтрПоискаПоШтрихкоду.Вставить(СтрШаблон("ШаблонНомерТелефона%1", СуффиксСерверЛояльности));
	КонецЕсли;
	Если КИПоШтрихкоду.Свойство("АдресЭП", АдресЭП) Тогда
		ФильтрПоискаПоШтрихкоду.Вставить(СтрШаблон("ШаблонАдресЭП%1", СуффиксСерверЛояльности));
	КонецЕсли;

	Если СтруктураДействий.Свойство("РегистрацияНовойКарты") Тогда
		ФильтрПоискаПоШтрихкоду.Вставить("РегистрацияНовойКарты");
	КонецЕсли;

	ДобавлятьНеизвестнуюКИ = Ложь;
	РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьПризнакВводаНеизвестнойКИ(Форма, ДобавлятьНеизвестнуюКИ);
	Если ДобавлятьНеизвестнуюКИ Тогда
		ФильтрПоискаПоШтрихкоду.Вставить("ДобавлятьНеизвестнуюКИ");
	КонецЕсли;

	Если ФильтрПоискаПоШтрихкоду.Свойство("Номенклатура") Тогда
		Если НЕ ФильтрПоискаПоШтрихкоду.Свойство("ШаблонНомерТелефона")
			И НЕ ФильтрПоискаПоШтрихкоду.Свойство("ШаблонАдресЭП") Тогда

			КодИКоличествоВесовогоТовара = Неопределено;
			РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьКодИКоличествоВесовогоТовара(Штрихкод, КодИКоличествоВесовогоТовара);

			Если НЕ КодИКоличествоВесовогоТовара = Неопределено Тогда
				ФильтрПоискаПоШтрихкоду.Вставить("ШаблонКодТовараSKU");
				Запрос.УстановитьПараметр("КодТовара", КодИКоличествоВесовогоТовара.КодТовара);
				Запрос.УстановитьПараметр("КоличествоТовара", КодИКоличествоВесовогоТовара.КоличествоТовара);
			КонецЕсли;

			Если НЕ ФильтрПоискаПоШтрихкоду.Свойство("ШаблонКодТовараSKU") Тогда
				ДанныеМаркировки = МенеджерОборудованияРМККлиентСервер.РазобратьШтриховойКодТовара(Штрихкод);
				ЭтоКодМаркировки = ЭтоШтрихкодМарки(ДанныеМаркировки);
				Если ЭтоКодМаркировки Тогда
					Если НЕ ДанныеМаркировки.EAN = Неопределено Тогда
						ШтрихкодПоиска = ДанныеМаркировки.EAN;
						ШтрихкодМарки = ДанныеМаркировки.EAN;
					КонецЕсли;
					ФильтрПоискаПоШтрихкоду.Вставить("ЭтоКодМаркировки");

					СимволGS1 = МенеджерОборудованияРМККлиентСервер.РазделительGS1();
					Разделитель = МенеджерОборудованияРМККлиентСервер.ЭкранированныйСимволGS1();
					КодМаркировкиОригинал = СтрЗаменить(Штрихкод, Разделитель, СимволGS1);
					ДанныеРазбораКода = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(КодМаркировкиОригинал);
					Если НЕ ДанныеРазбораКода = Неопределено Тогда
						ШтрихкодМарки = ДанныеРазбораКода.НормализованныйКодМаркировки;
						Если ДанныеРазбораКода.Свойство("СоставКодаМаркировки") Тогда
							СоставКодаМаркировки = ДанныеРазбораКода.СоставКодаМаркировки;
							Если СоставКодаМаркировки.Свойство("EAN") И ЗначениеЗаполнено(СоставКодаМаркировки.EAN) Тогда
								ШтрихкодПоиска = СоставКодаМаркировки.EAN;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;

				КонецЕсли;
			КонецЕсли;

		КонецЕсли;
	КонецЕсли;

	НеизвестныеДанныеПО = Истина;
	СтруктураПараметров = СтруктураДанныхПоиска();

	ВыполнитьПоиск = Истина;
	Если ЭтоКодМаркировки Тогда
		СимволGS1 = МенеджерОборудованияРМККлиентСервер.РазделительGS1();
		Если СтрНайти(КодМаркировкиОригинал, СимволGS1) > 0 И ДанныеРазбораКода = Неопределено Тогда
			ВыполнитьПоиск = Ложь;
		КонецЕсли;
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ФильтрПоискаПоШтрихкоду", ФильтрПоискаПоШтрихкоду);
	ДополнительныеПараметры.Вставить("ШтрихкодОригинал", Штрихкод);
	ДополнительныеПараметры.Вставить("ШтрихкодПоиска", ШтрихкодПоиска);
	ДополнительныеПараметры.Вставить("ШтрихкодМарки", ШтрихкодМарки);
	ДополнительныеПараметры.Вставить("ДанныеМаркировки", ДанныеМаркировки);
	ДополнительныеПараметры.Вставить("ДанныеРазбораКода", ДанныеРазбораКода);
	ДополнительныеПараметры.Вставить("ЭтоКодМаркировки", ЭтоКодМаркировки);
	РаботаСоШтрихкодамиПереопределяемый.ПереопределитьПризнакВыполненияПоиска(ВыполнитьПоиск, ДополнительныеПараметры);

	ДополнительныеПараметры.Вставить("НекорректнаяМарка", Не ВыполнитьПоиск);

	Если ВыполнитьПоиск Тогда
		ТекстЗапроса = ТекстЗапросаШтрихкодыБазы(ФильтрПоискаПоШтрихкоду);

		ТекстЗапросаВыборки = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШтрихкодыВсе.Штрихкод КАК Штрихкод,
		|	ШтрихкодыВсе.Владелец КАК Владелец,
		|	ШтрихкодыВсе.Характеристика КАК Характеристика,
		|	ШтрихкодыВсе.Упаковка КАК Упаковка,
		|	ШтрихкодыВсе.Серия КАК СерияНоменклатуры,
		|	ШтрихкодыВсе.Партия КАК Партия,
		|	ТИПЗНАЧЕНИЯ(ШтрихкодыВсе.Владелец) КАК ТипОбъекта,
		|	ШтрихкодыВсе.ШаблонШтрихкода КАК ШаблонШтрихкода,
		|	0 КАК НомерСтроки,
		|	ШтрихкодыВсе.Количество КАК Количество
		|ИЗ
		|	ШтрихкодыВсе КАК ШтрихкодыВсе";

		ТекстЗапроса = ТекстЗапроса +
		"
		|; 
		|////////////////////////////////////////////////////////////////////////////////
		|" + ТекстЗапросаВыборки;

		Запрос.Текст = ТекстЗапроса;

		ПараметрНомерТелефона = ОбщегоНазначенияРМК.ПолучитьОбратныйНомерТелефонаБезКодаСтраны(НомерТелефона);
		РаботаСоШтрихкодамиПереопределяемый.ПодготовитьНомерТелефонаДляПоиска(ПараметрНомерТелефона, НомерТелефона);
		Запрос.УстановитьПараметр("Штрихкод", ШтрихкодПоиска);
		Запрос.УстановитьПараметр("ШтрихкодМарки", ШтрихкодМарки);
		Запрос.УстановитьПараметр("ДлинаШтрихкода", СтрДлина(ШтрихкодПоиска));
		Запрос.УстановитьПараметр("НомерТелефона", ПараметрНомерТелефона);
		Запрос.УстановитьПараметр("ШтрихкодИнверсия", ПолучитьИнверсиюСтроки(ШтрихкодПоиска));
		Запрос.УстановитьПараметр("АдресЭП", АдресЭП);

		РаботаСоШтрихкодамиПереопределяемый.ДополнитьПараметрыЗапросаПоиска(Запрос, Форма, ДополнительныеПараметры);
		#Вставка
		//Вик 2026-06-18
		Если Запрос.Выполнить().Пустой() тогда
			Запрос_ТБК	=	Новый Запрос("ВЫБРАТЬ
			          	 	             |	ТБК_Штрихкоды.Владелец КАК Владелец,
			          	 	             |	ТБК_Штрихкоды.Упаковка КАК Упаковка,
			          	 	             |	ТБК_Штрихкоды.ТипШтрихкода КАК ТипШтрихкода
			          	 	             |ИЗ
			          	 	             |	РегистрСведений.ТБК_Штрихкоды КАК ТБК_Штрихкоды
			          	 	             |ГДЕ
			          	 	             |	ТБК_Штрихкоды.Штрихкод = &Штрихкод");
			Запрос_ТБК.УстановитьПараметр("Штрихкод", ШтрихкодПоиска);
			Рез = Запрос_ТБК.Выполнить().Выбрать();
			
			Если Рез.Следующий() тогда 
				
				Запись = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись,Рез);
				Запись.Штрихкод = ШтрихкодПоиска;
				Попытка
					Запись.Записать();
				Исключение
				КонецПопытки;			
			КонецЕсли;       		
		КонецЕсли;  
		//
		#КонецВставки
	
		Выборка = Запрос.Выполнить().Выбрать();

		ДополнитьСтруктуруРезультатамиПоиска(СтруктураПараметров, Выборка, Штрихкод, "", НеизвестныеДанныеПО);

	КонецЕсли;

	СтруктураПараметров.ПараметрыШтрихкода = ДополнительныеПараметры;
	СтруктураПараметров.Вставить("ФормаВызова", Форма);

	РаботаСоШтрихкодамиПереопределяемый.СкорректироватьСтруктуруРезультата(
	СтруктураПараметров,
	Штрихкод,
	СтруктураДействий,
	НеизвестныеДанныеПО,
	Истина);
	СтруктураПараметров.Удалить("ФормаВызова");

	НайденоОбъектов = СтруктураПараметров.ЗначенияПоиска.Количество();
	Если НайденоОбъектов > 1 Тогда
		СтруктураПараметров.Вставить("ИспользоватьНовыйАлгоритмПоискаПоШтрихкоду");
	КонецЕсли;

	СтруктураПараметров.НеизвестныеДанныеПО = НеизвестныеДанныеПО;

	Позиция = НайтиНедопустимыеСимволыXML(Штрихкод);
	Если Позиция > 0 Тогда
		Штрихкод = Лев(Штрихкод, Позиция - 1);
	КонецЕсли;

	РеквизитыФормыРМК = Форма;
	СтруктураПараметров.ДанныеПО = Штрихкод;
	СтруктураПараметров.ТипДанныхПО = "Штрихкод";
	СтруктураПараметров.ПараметрыШтрихкода = ДополнительныеПараметры;

	ПределКэшированияСтрок = 30;
	Если РеквизитыФормыРМК.ИмяФормы = "Обработка.РабочееМестоКассира.Форма.ФормаРМК"
		И ТипЗнч(РеквизитыФормыРМК) = Тип("Структура") Тогда

		СтруктураПараметров.РеквизитыФормыРМК = РеквизитыФормыРМК;

		Если НайденоОбъектов < ПределКэшированияСтрок Тогда

			Если РеквизитыФормыРМК.Свойство("ПараметрыДляОбработкиШтрихкода") Тогда
				РеквизитыФормыРМК.ПараметрыДляОбработкиШтрихкода.Вставить("ПараметрыШтрихкода", ДополнительныеПараметры);
			КонецЕсли;

			НесколькоЗначенийПоиска = НайденоОбъектов > 1;
			Если НесколькоЗначенийПоиска Тогда
				ПустаяСтрокаТаблицыТоваров = ОбщегоНазначения.СкопироватьРекурсивно(РеквизитыФормыРМК.ПустаяСтрокаТаблицыТоваров);
			Иначе
				ПустаяСтрокаТаблицыТоваров = РеквизитыФормыРМК.ПустаяСтрокаТаблицыТоваров;
			КонецЕсли;

			МассивКонтрагентов = Новый Массив;
			МассивРазличныхЗначений = Новый Массив;
			КоличествоКартЛояльности = 0;

			Для Каждого СтрокаЗначения Из СтруктураПараметров.ЗначенияПоиска Цикл

				Если МассивРазличныхЗначений.Найти(СтрокаЗначения.Владелец) = Неопределено Тогда
					МассивРазличныхЗначений.Добавить(СтрокаЗначения.Владелец);
				КонецЕсли;

				Если СтрокаЗначения.Свойство("Номенклатура") И ЗначениеЗаполнено(СтрокаЗначения.Номенклатура) Тогда

					Если НесколькоЗначенийПоиска Тогда
						ПустаяСтрокаТаблицыТоваровДляЗаполнения = ОбщегоНазначения.СкопироватьРекурсивно(ПустаяСтрокаТаблицыТоваров);
						РеквизитыФормыРМК.Вставить("ПустаяСтрокаТаблицыТоваров" ,ПустаяСтрокаТаблицыТоваровДляЗаполнения);
					КонецЕсли;

					ДополнитьЗначениеСтрокойТовара(СтрокаЗначения, СтруктураПараметров, ПустаяСтрокаТаблицыТоваров);

				ИначеЕсли СтрокаЗначения.Свойство("ВладелецКарты")
					И ЗначениеЗаполнено(СтрокаЗначения.ВладелецКарты) Тогда

					ШтрихкодированиеРМКПереопределяемый.ДополнитьМассивВладельцамиКарт(МассивКонтрагентов, СтрокаЗначения.ВладелецКарты);
					КоличествоКартЛояльности = КоличествоКартЛояльности + 1;

				КонецЕсли;

			КонецЦикла;

			СтруктураПараметров.Вставить("ОткрытьФормуСписанияБаллов", Ложь);
			СтруктураПараметров.Вставить("ОдинВладелец", МассивКонтрагентов.Количество() = 1);
			Если МассивРазличныхЗначений.Количество() > 1
				И НайденоОбъектов = КоличествоКартЛояльности Тогда
				СтруктураПараметров.ОткрытьФормуСписанияБаллов = Истина;
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	Возврат СтруктураПараметров;

КонецФункции
